import type React from 'react'
import { useAuth } from '@contexts/'
import styles from './styles/IndexPage2.module.scss'
import { AuthModal } from '@components/'
import { IndexHeader } from '../../components/IndexHeader/IndexHeader'
import { IndexHeaderSticky } from '../../components/IndexHeader/IndexHeaderSticky'

export const IndexPage: React.FC = () => {
  const { openAuthModal, isAuthenticated } = useAuth()

  return (
    <div className={styles.indexPage}>
      <IndexHeaderSticky
        isAuthenticated={isAuthenticated}
        openAuthModal={openAuthModal}
      />
      <div className={styles.contentWrapper}>
        <header className={styles.divWithImage}>
          {/* <IndexHeader
            isAuthenticated={isAuthenticated}
            openAuthModal={openAuthModal}
          /> */}
          <div className={styles.slogan}>
            {['я', 'могу', 'помочь'].map((el, i) => (
              <span className={styles[`span${i + 1}`]} key={i}>
                {el}
              </span>
            ))}
          </div>
        </header>

        <main className={styles.pageContainer}>
          <div className={styles.pageUp} id={'introduction'}>
            <h2>Описание платформы</h2>
            <p>Текст текст текст</p>

            <p>
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание Описание Описание Описание Описание Описание Описание
              Описание
            </p>
          </div>
          <div className={styles.pageDown} id={'products'}>
            <h2>Наши продукты</h2>
            <p>Текст текст текст</p>
            <p>
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты Продукты Продукты Продукты Продукты Продукты Продукты
              Продукты
            </p>
          </div>
          <div className={styles.pageDown} id={'innovations'}>
            <h2>Наши инновации</h2>
            <p>Текст текст текст</p>
            <p>
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации Инновации Инновации
              Инновации Инновации Инновации Инновации
            </p>
          </div>
          <div className={styles.pageDown} id={'pricing'}>
            <h2>Наши цены</h2>
            <p>Текст текст текст</p>
            <p>
              Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены
              Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены
              Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены
              Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены
              Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены Цены
            </p>
          </div>
          <div className={styles.pageDown} id={'documentation'}>
            <h2>Документация</h2>
            <p>Текст текст текст</p>
            <p>
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация Документация
              Документация Документация Документация Документация
            </p>
          </div>
        </main>
      </div>
      <AuthModal />
      <footer className={styles.indexFooter}>
        наши контактные данные: +763535670932, город Санкт-Петербург, улица
        такая-то, дом-такой-то
      </footer>
    </div>
  )
}
